Revit 2027 API
FabricationConfiguration.GetAllLoadedServices Method
 Returns all the loaded fabrication services.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<FabricationService> GetAllLoadedServices()
Public Function GetAllLoadedServices As IList(Of FabricationService)
public:
IList<FabricationService^>^ GetAllLoadedServices()
member GetAllLoadedServices : unit -> IList<FabricationService>
Return Value
IList<FabricationService>
 All the loaded fabrication services.
See Also
Reference
FabricationConfiguration Class
Autodesk.Revit.DB Namespace